6.1 Reding and Writing Data in Text Format

In [51]:
import pandas as pd
import numpy as np

pandas 불러오기

In [3]:
a=pd.read_excel("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/6_1.xlsx")

In [4]:
a

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

excel 파일을 pandas를 사용해서 불러오기

In [6]:
a=pd.read_excel("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/6_1.xlsx",header=None)

In [7]:
a

   0   1   2   3        4
0  a   b   c   d  message
1  1   2   3   4    hello
2  5   6   7   8    world
3  9  10  11  12      foo

header=None: 컬럼 값이 없는 데이터프레임에 대해 저장하거나 불러올 때 사용

In [9]:
a=pd.read_excel("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/6_1.xlsx",names=['a','b','c','d','message'])

In [10]:
a

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

names=[]: 데이터 프레임을 읽어올 때 컬럼 값을 지정해주고 싶을 때 사용

In [13]:
parsed=pd.read_csv("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/실습 파일/csv_mindex.csv",
               index_col=['key1','key2'])

In [14]:
parsed

           value1  value2
key1 key2
one  a          1       2
     b          3       4
     c          5       6
     d          7       8
two  a          9      10
     b         11      12
     c         13      14
     d         15      16

csv 파일 불러오기,
index_col[]: 테이블 내의 특정한 열을 행 인덱스로 지정하고 싶을 때 사용

In [19]:
list(open("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/실습 파일/ex33.txt"))

['a b c\n', 'aaa 1 2 3 \n', 'bbb 4 5 6\n', 'ccc 7 8 9\n', 'ddd 10 11 12']

txt파일 배열로 열기

In [20]:
result=pd.read_table("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/실습 파일/ex33.txt",
                    sep='\s+')

In [21]:
result

      a   b   c
aaa   1   2   3
bbb   4   5   6
ccc   7   8   9
ddd  10  11  12

데이터를 '\s+'로 구분

In [23]:
a=pd.read_excel("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/6_1.xlsx")

In [24]:
a

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [25]:
a=pd.read_excel("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/6_1.xlsx",
               skiprows=[0,2,3])

In [26]:
a

Empty DataFrame
Columns: [1, 2, 3, 4, hello]
Index: []

skiprows=[]: 특정한 행만 불러오고 싶을 때 사용/원하는 곳에 있는 데이터만 취득 가능, 불러오고 싶지 않은 행을 입력

In [27]:
result=pd.read_excel("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/실습 파일/ex55.xlsx")

In [28]:
result

  something  a   b   c   d message
0       one  1   2   3   4     NaN
1       two  5   6       8   world
2     three  9  10  11  12     foo

In [29]:
pd.isnull(result)

   something      a      b      c      d  message
0      False  False  False  False  False     True
1      False  False  False  False  False    False
2      False  False  False  False  False    False

.isnull(): 값이 있으면 False, 값이 없으면 True라고 표기

Reading Text Files in Pieces

In [30]:
pd.options.display.max_rows=10

In [31]:
result=pd.read_csv("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/실습 파일/ex6.csv")

In [32]:
result

           one       two     three      four key
0     0.467976 -0.038649 -0.295344 -1.824726   L
1    -0.358893  1.404453  0.704965 -0.200638   B
2    -0.501840  0.659254 -0.421691 -0.057688   G
3     0.204886  1.074134  1.388361 -0.982404   R
4     0.354628 -0.133116  0.283763 -0.837063   Q
...        ...       ...       ...       ...  ..
9995  2.311896 -0.417070 -1.409599 -0.515821   L
9996 -0.479893 -0.650419  0.745152 -0.646038   E
9997  0.523331  0.787112  0.486066  1.093156   K
9998 -0.362559  0.598894 -1.843201  0.887292   G
9999 -0.096376 -1.012999 -0.657431 -0.573315   0

[10000 rows x 5 columns]

pd.options.display.max_rows=10: 표를 출력할 때 최대 행 수 > 최대 10행 까지 출력 가능

In [33]:
a=pd.read_csv("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/실습 파일/ex6.csv",nrows=5)

In [34]:
a

        one       two     three      four key
0  0.467976 -0.038649 -0.295344 -1.824726   L
1 -0.358893  1.404453  0.704965 -0.200638   B
2 -0.501840  0.659254 -0.421691 -0.057688   G
3  0.204886  1.074134  1.388361 -0.982404   R
4  0.354628 -0.133116  0.283763 -0.837063   Q

nrows: 파일 전체를 읽는 대신 처음 몇 줄만 읽어보고 싶을 때 사용

In [36]:
chunker=pd.read_csv("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/실습 파일/ex6.csv",chunksize=1000)

In [37]:
chunker

chunksize: 한번에 가져올 데이터 양 > 대용량 csv 데이터 다룰 때 사용

In [39]:
tot=pd.Series([])
for piece in chunker:
    tot=tot.add(piece['key'].value_counts(),fill_value=0)

tot=tot.sort_values(ascending=False)

<ipython-input-39-1c1a3e33f76a>:1: DeprecationWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  tot=pd.Series([])

Writing Data to Text Format

In [41]:
data=pd.read_csv("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/실습 파일/ex5.csv")

In [42]:
data

  something  a   b     c   d message
0       one  1   2   3.0   4     NaN
1       two  5   6   NaN   8   world
2     three  9  10  11.0  12     foo

In [43]:
data.to_csv(sep=',')

',something,a,b,c,d,message\r\n0,one,1,2,3.0,4,\r\n1,two,5,6,,8,world\r\n2,three,9,10,11.0,12,foo\r\n'

In [44]:
import sys
data.to_csv(sys.stdout,sep='|')

|something|a|b|c|d|message
0|one|1|2|3.0|4|
1|two|5|6||8|world
2|three|9|10|11.0|12|foo

sep=',': 콤마(,)로 데이터 구분
,sep='|':'|'로 데이터 구분
,sys.stdout: sys.stdout에 기록해서 텍스트 결고를 콘솔에 출력

In [46]:
data.to_csv(sys.stdout,na_rep='NULL')

,something,a,b,c,d,message
0,one,1,2,3.0,4,NULL
1,two,5,6,NULL,8,world
2,three,9,10,11.0,12,foo

na_rep: 결과에서 누락된 값은 기본적으로 비어있는 문자열로 나타냄, [na_rep="NULL"]과 같이 원하는 값으로 지정가능

In [48]:
data.to_csv(sys.stdout,index=False,header=False)

one,1,2,3.0,4,
two,5,6,,8,world
three,9,10,11.0,12,foo

header: True면 header출력, Index: True면 Index출력

In [49]:
data.to_csv(sys.stdout,index=False,columns=['a','b','c'])

a,b,c
1,2,3.0
5,6,
9,10,11.0

columns: 세로 열 이름, Index: 가로 열 이름

In [52]:
dates=pd.date_range('1/1/2000',periods=7)
ts=pd.Series(np.arange(7), index=dates)
ts.to_csv("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/실습 파일/tseries.csv")
a=pd.read_csv("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/실습 파일/tseries.csv")

In [53]:
a

   Unnamed: 0  0
0  2000-01-01  0
1  2000-01-02  1
2  2000-01-03  2
3  2000-01-04  3
4  2000-01-05  4
5  2000-01-06  5
6  2000-01-07  6

date_range(시작 날짜, period), period= :시작 날짜부터 원하는 개수 만큼 날짜 생성

Working with Delimited Formats

In [54]:
import csv

In [56]:
f=open("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/실습 파일/ex7.csv")
reader=csv.reader(f)

In [58]:
for line in reader:
    print(line)

['a', 'b', 'c']
['1', '2', '3']
['1', '2', '3']

In [59]:
with open("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/실습 파일/ex7.csv") as f:
    lines=list(csv.reader(f))

In [62]:
header, values=lines[0], lines[1:]

In [63]:
data_dict={h: v for h, v in zip(header, zip(*values))}
data_dict

{'a': ('1', '1'), 'b': ('2', '2'), 'c': ('3', '3')}

import csv: 단일 문자 구분 기호가 있는 모든 파일은 사용가능, 사용하려면 열려 있는 파일이나 파일 같은 개체를 csv.reader로 전달

JSON Data

In [65]:
obj = """
{"name": "wes",
"places_lived": ["United States", "Spain", "Germany"],
"pet": null,
"siblings": [{"name": "Scott", "age": 30, "pets": ["Zeus","Zuko"]},
             {"name": "Katie", "age": 38,
             "pets": ["Sixes", "Stache", "Cisco"]}]
}
"""

In [66]:
import json
result = json.loads(obj)

In [67]:
result

{'name': 'wes',
 'places_lived': ['United States', 'Spain', 'Germany'],
 'pet': None,
 'siblings': [{'name': 'Scott', 'age': 30, 'pets': ['Zeus', 'Zuko']},
  {'name': 'Katie', 'age': 38, 'pets': ['Sixes', 'Stache', 'Cisco']}]}

In [68]:
asjson = json.dumps(result)

In [70]:
siblings=pd.DataFrame(result['siblings'],columns=['name','age'])

In [71]:
siblings

    name  age
0  Scott   30
1  Katie   38

JSON: 'Java Script Object Notification'의 줄임말> 효율적으로 데이터를 저장하고 교환(데이터 교환)하는데 사용하는 텍스터 데이터 포맷 중 하나

json.load: str 전처리 필요없이 바로 데이터에 접근해서 사용가능> JSON 문자열을 파이썬 객체로 바꾸어 줌.

json.dumps: 파이썬 객체를 JSON 문자열로 바꾸어 줌

In [73]:
data=pd.read_json("C:/Users/shinyoungmin/Desktop/수DA쟁이/과제/실습 파일/example.json")

In [74]:
data

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

In [75]:
print(data.to_json())
print(data.to_json(orient='records'))

{"a":{"0":1,"1":4,"2":7},"b":{"0":2,"1":5,"2":8},"c":{"0":3,"1":6,"2":9}}
[{"a":1,"b":2,"c":3},{"a":4,"b":5,"c":6},{"a":7,"b":8,"c":9}]

to_json(): pandas에서 JSON으로 데이터를 내보내야 하는 경우 Series및 Data에서 사용

7.3

7.3.1 문자열 객체 매서드

In [76]:
val='a,b,guido'

In [77]:
val.split(',')

['a', 'b', 'guido']

,를 기준으로 쪼개기

In [78]:
pieces=[x.strip() for x in val.split(',')]

In [79]:
pieces

['a', 'b', 'guido']

strip()은 문자열에서 양쪽에 있는 연속된 모든 공백을 삭제한다.

In [80]:
first,second,third=pieces

In [82]:
first+','+second+','+third

'a,b,guido'

first,scond,third 에 각각 문자를 넣고 ','를 넣고 합침

In [83]:
','.join(pieces)

'a,b,guido'

구분자 문자열과 문자열 리스트의 요소를 연결하여 문자열로 만든다.

In [84]:
'guido' in val

True

여부 확인

In [85]:
val.index(':')

ValueError: substring not found

index는 찾는 문자가 없으면 오류를 낸다.

In [86]:
val.find(':')

-1

find는 찾는 문자가 없으면 -1을 반환

In [87]:
val.count(',')

2

세주기

In [90]:
val.replace(',','/')
val.replace('/','')

'a,b,guido'

replace(a,b): a 대신 b 채움

7.3.2 정규 표현식

In [91]:
import re

In [92]:
text='foo    bar\t baz \tqux'

In [93]:
re.split('\s+',text)

['foo', 'bar', 'baz', 'qux']

In [95]:
regex=re.compile('\s+')

In [96]:
regex

re.compile(r'\s+', re.UNICODE)

In [97]:
regex.split(text)

['foo', 'bar', 'baz', 'qux']

In [99]:
regex.findall(text)

['    ', '\t ', ' \t']

In [100]:
text='Dave dave@google.com Steve steve@gmail.com Rob rob@gmail.com Ryan ryan@yahoo.com'

In [101]:
pattern=r"[A-Z0-9._%+-]+@[A-Z0-9.-]+\.[A-Z]{2,4}"

In [102]:
regex=re.compile(pattern, flags=re.IGNORECASE)

In [103]:
regex.findall(text)

['dave@google.com', 'steve@gmail.com', 'rob@gmail.com', 'ryan@yahoo.com']

In [104]:
m=regex.search(text)

In [105]:
m

In [106]:
text[m.start():m.end()]

'dave@google.com'

In [107]:
print(regex.sub('REDACTED',text))

Dave REDACTED Steve REDACTED Rob REDACTED Ryan REDACTED

In [108]:
pattern=r'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\.([A-Z]{2,4})'

In [109]:
regex=re.compile(pattern,flags=re.IGNORECASE)

In [111]:
m=regex.match('wesm@bright.net')

In [113]:
m.groups()

('wesm', 'bright', 'net')

In [114]:
regex.findall(text)

[('dave', 'google', 'com'),
 ('steve', 'gmail', 'com'),
 ('rob', 'gmail', 'com'),
 ('ryan', 'yahoo', 'com')]

In [115]:
print(regex.sub(r'Username: \1, Domain: \2, Suffix: \3',text))

Dave Username: dave, Domain: google, Suffix: com Steve Username: steve, Domain: gmail, Suffix: com Rob Username: rob, Domain: gmail, Suffix: com Ryan Username: ryan, Domain: yahoo, Suffix: com

In [133]:
data={'Dave':'dave@google.com','Steve':'steve@gmail.com','Rob':'rob@gmail.com','Wes':np.nan}

In [134]:
data

{'Dave': 'dave@google.com',
 'Steve': 'steve@gmail.com',
 'Rob': 'rob@gmail.com',
 'Wes': nan}

In [135]:
data=pd.Series(data)

In [136]:
data

Dave     dave@google.com
Steve    steve@gmail.com
Rob        rob@gmail.com
Wes                  NaN
dtype: object

In [137]:
data.isnull()

Dave     False
Steve    False
Rob      False
Wes       True
dtype: bool

In [139]:
data.str.contains('gmail')

Dave     False
Steve     True
Rob       True
Wes        NaN
dtype: object

In [140]:
pattern

'([A-Z0-9._%+-]+)@([A-Z0-9.-]+)\\.([A-Z]{2,4})'

In [141]:
data.str.findall(pattern,flags=re.IGNORECASE)

Dave     [(dave, google, com)]
Steve    [(steve, gmail, com)]
Rob        [(rob, gmail, com)]
Wes                        NaN
dtype: object

In [142]:
matches=data.str.match(pattern,flags=re.IGNORECASE)

In [143]:
matches

Dave     True
Steve    True
Rob      True
Wes       NaN
dtype: object

In [146]:
data.str[:5]

Dave     dave@
Steve    steve
Rob      rob@g
Wes        NaN
dtype: object

8.2 데이터 합치기

8.2.1데이터 베이스 스타일로 DataFrame 합치기

In [154]:
df1=pd.DataFrame({'key': ['b','b','a','c','a','a','b'],
                'data1':range(7)})

In [155]:
df2=pd.DataFrame({'key': ['a','b','d'],
                'data2':range(3)})

In [156]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   a      5
6   b      6

In [157]:
df2

  key  data2
0   a      0
1   b      1
2   d      2

In [158]:
pd.merge(df1,df2)

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

merge 함수: 중복된 컬럼 이름을 키로 사용함. 기본적으로 내부 조인을 수행하여 교집합인 결과를 반환 함

In [159]:
pd.merge(df1,df2,on='key')

  key  data1  data2
0   b      0      1
1   b      1      1
2   b      6      1
3   a      2      0
4   a      4      0
5   a      5      0

on: 조인하려는 컬럼 이름

In [172]:
df3=pd.DataFrame({'lkey':['b','b','a','c','a','a','b'],
                 'data1':range(7)})

In [173]:
df4=pd.DataFrame({'rkey': ['a','b','d'],
                'data2':range(3)})

In [174]:
df3

  lkey  data1
0    b      0
1    b      1
2    a      2
3    c      3
4    a      4
5    a      5
6    b      6

In [175]:
df4

  rkey  data2
0    a      0
1    b      1
2    d      2

In [176]:
 pd.merge(df3, df4, left_on='lkey', right_on='rkey')

  lkey  data1 rkey  data2
0    b      0    b      1
1    b      1    b      1
2    b      6    b      1
3    a      2    a      0
4    a      4    a      0
5    a      5    a      0

In [177]:
pd.merge(df1,df2,how='outer')

  key  data1  data2
0   b    0.0    1.0
1   b    1.0    1.0
2   b    6.0    1.0
3   a    2.0    0.0
4   a    4.0    0.0
5   a    5.0    0.0
6   c    3.0    NaN
7   d    NaN    2.0

외부 조인 (합집합)

In [179]:
df1=pd.DataFrame({'key':['b','b','a','c','a','b'],
                 'data1':range(6)})

In [180]:
df2=pd.DataFrame({'key':['a','b','a','b','d'],
                 'data2':range(5)})

In [181]:
df1

  key  data1
0   b      0
1   b      1
2   a      2
3   c      3
4   a      4
5   b      5

In [182]:
df2

  key  data2
0   a      0
1   b      1
2   a      2
3   b      3
4   d      4

In [184]:
pd.merge(df1,df2,on='key',how='left')

   key  data1  data2
0    b      0    1.0
1    b      0    3.0
2    b      1    1.0
3    b      1    3.0
4    a      2    0.0
..  ..    ...    ...
6    c      3    NaN
7    a      4    0.0
8    a      4    2.0
9    b      5    1.0
10   b      5    3.0

[11 rows x 3 columns]

In [185]:
pd.merge(df1,df2,how='inner')

  key  data1  data2
0   b      0      1
1   b      0      3
2   b      1      1
3   b      1      3
4   b      5      1
5   b      5      3
6   a      2      0
7   a      2      2
8   a      4      0
9   a      4      2

다대다: 두 로우 개수의 곱만큼 반환

In [190]:
left=pd.DataFrame({'key1':['foo','foo','bar'],
                  'key2':['one','two','three'],
                  'lval':[1,2,3]})

In [191]:
right=pd.DataFrame({'key1':['foo','foo','bar','bar'],
                  'key2':['one','two','three','two'],
                  'lval':[4,5,6,7]})

In [192]:
pd.merge(left,right,on=['key1','key2'],how='outer')

  key1   key2  lval_x  lval_y
0  foo    one     1.0       4
1  foo    two     2.0       5
2  bar  three     3.0       6
3  bar    two     NaN       7

여러개의 키를 병합하려면 컬럼 이름이 담긴 리스트를 넘기면 된다.

In [193]:
left

  key1   key2  lval
0  foo    one     1
1  foo    two     2
2  bar  three     3

In [194]:
right

  key1   key2  lval
0  foo    one     4
1  foo    two     5
2  bar  three     6
3  bar    two     7

In [206]:
pd.merge(left,right,on='key1')

  key1 key2_x  lval_x key2_y  lval_y
0  foo    one       1    one       4
1  foo    one       1    two       5
2  foo    two       2    one       4
3  foo    two       2    two       5
4  bar  three       3  three       6
5  bar  three       3    two       7

In [207]:
pd.merge(left,right,on='key1',suffixes=('_left','_right'))

  key1 key2_left  lval_left key2_right  lval_right
0  foo       one          1        one           4
1  foo       one          1        two           5
2  foo       two          2        one           4
3  foo       two          2        two           5
4  bar     three          3      three           6
5  bar     three          3        two           7

suffixes: 컬럼 이름이 겹칠 경우 각 컬럼 이름 뒤에 붙일 문자열의 튜플